espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration Register */
/** Type of sys_ctrl register
 *  H264 system level control register.
 */
typedef union {
    struct {
        /** frame_start : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to start encoding one frame.\\0: Invalid. No effect\\1:
         *  Start encoding one frame
         */
        uint32_t frame_start: 1;
        /** dma_move_start : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to start moving reference data from external mem.\\0:
         *  Invalid. No effect\\1: H264 start moving two MB lines of reference frame from
         *  external mem to internal mem
         */
        uint32_t dma_move_start: 1;
        /** frame_mode : R/W; bitpos: [2]; default: 0;
         *  Configures H264 running mode. When field H264_DUAL_STREAM_MODE is set to 1, this
         *  field must be set to 1 too.\\0: GOP mode. Before every GOP first frame start, need
         *  reconfig reference frame DMA\\1: Frame mode. Before every frame start, need
         *  reconfig reference frame DMA
         */
        uint32_t frame_mode: 1;
        /** sys_rst_pulse : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to reset H264 ip.\\0: Invalid. No effect\\1: Reset H264 ip
         */
        uint32_t sys_rst_pulse: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} h264_sys_ctrl_reg_t;

/** Type of gop_conf register
 *  GOP related configuration register.
 */
typedef union {
    struct {
        /** dual_stream_mode : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable dual stream mode. When this field is set to 1,
         *  H264_FRAME_MODE field must be set to 1 too.\\0: Normal mode\\1: Dual stream mode
         */
        uint32_t dual_stream_mode: 1;
        /** gop_num : R/W; bitpos: [8:1]; default: 0;
         *  Configures the frame number of one GOP.\\0: The frame number of one GOP is
         *  infinite\\Others: Actual frame number of one GOP
         */
        uint32_t gop_num: 8;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_gop_conf_reg_t;

/** Type of sys_mb_res register
 *  Video A horizontal and vertical MB resolution register.
 */
typedef union {
    struct {
        /** sys_total_mb_y : R/W; bitpos: [6:0]; default: 0;
         *  Configures video A vertical MB resolution.
         */
        uint32_t sys_total_mb_y: 7;
        /** sys_total_mb_x : R/W; bitpos: [13:7]; default: 0;
         *  Configures video A horizontal MB resolution.
         */
        uint32_t sys_total_mb_x: 7;
        uint32_t reserved_14: 18;
    };
    uint32_t val;
} h264_sys_mb_res_reg_t;

/** Type of sys_conf register
 *  Video A system level configuration register.
 */
typedef union {
    struct {
        /** db_tmp_ready_trigger_mb_num : R/W; bitpos: [6:0]; default: 3;
         *  Configures when to trigger  video A H264_DB_TMP_READY_INT. When the (MB number of
         *  written db temp+1) is greater than this filed in first MB line, trigger
         *  H264_DB_TMP_READY_INT. Min is 3.
         */
        uint32_t db_tmp_ready_trigger_mb_num: 7;
        /** rec_ready_trigger_mb_lines : R/W; bitpos: [13:7]; default: 4;
         *  Configures when to trigger  video A H264_REC_READY_INT. When the MB line number of
         *  generated reconstruct pixel is greater than this filed, trigger H264_REC_READY_INT.
         *  Min is 4.
         */
        uint32_t rec_ready_trigger_mb_lines: 7;
        /** intra_cost_cmp_offset : R/W; bitpos: [29:14]; default: 0;
         *  Configures video A intra cost offset when I MB compared with P MB.
         */
        uint32_t intra_cost_cmp_offset: 16;
        uint32_t reserved_30: 2;
    };
    uint32_t val;
} h264_sys_conf_reg_t;

/** Type of deci_score register
 *  Video A luma and chroma MB decimate score Register.
 */
typedef union {
    struct {
        /** c_deci_score : R/W; bitpos: [9:0]; default: 0;
         *  Configures video A chroma MB decimate score. When chroma score is smaller than it,
         *  chroma decimate will be enable.
         */
        uint32_t c_deci_score: 10;
        /** l_deci_score : R/W; bitpos: [19:10]; default: 0;
         *  Configures video A luma MB decimate score. When luma score is smaller than it, luma
         *  decimate will be enable.
         */
        uint32_t l_deci_score: 10;
        uint32_t reserved_20: 12;
    };
    uint32_t val;
} h264_deci_score_reg_t;

/** Type of deci_score_offset register
 *  Video A luma and chroma MB decimate score offset Register.
 */
typedef union {
    struct {
        /** i16x16_deci_score_offset : R/W; bitpos: [5:0]; default: 0;
         *  Configures video A i16x16 MB decimate score offset. This offset will be added to
         *  i16x16 MB score.
         */
        uint32_t i16x16_deci_score_offset: 6;
        /** i_chroma_deci_score_offset : R/W; bitpos: [11:6]; default: 0;
         *  Configures video A I chroma MB decimate score offset. This offset will be added to
         *  I chroma MB score.
         */
        uint32_t i_chroma_deci_score_offset: 6;
        /** p16x16_deci_score_offset : R/W; bitpos: [17:12]; default: 0;
         *  Configures video A p16x16 MB decimate score offset. This offset will be added to
         *  p16x16 MB score.
         */
        uint32_t p16x16_deci_score_offset: 6;
        /** p_chroma_deci_score_offset : R/W; bitpos: [23:18]; default: 0;
         *  Configures video A p chroma MB decimate score offset. This offset will be added to
         *  p chroma MB score.
         */
        uint32_t p_chroma_deci_score_offset: 6;
        uint32_t reserved_24: 8;
    };
    uint32_t val;
} h264_deci_score_offset_reg_t;

/** Type of rc_conf0 register
 *  Video A rate control configuration register0.
 */
typedef union {
    struct {
        /** qp : R/W; bitpos: [5:0]; default: 0;
         *  Configures video A frame level initial luma QP value.
         */
        uint32_t qp: 6;
        /** rate_ctrl_u : R/W; bitpos: [21:6]; default: 0;
         *  Configures video A parameter U value. U = int((float) u << 8).
         */
        uint32_t rate_ctrl_u: 16;
        /** mb_rate_ctrl_en : R/W; bitpos: [22]; default: 0;
         *  Configures video A whether or not to open macro block rate ctrl.\\1:Open the macro
         *  block rate ctrl\\1:Close the macro block rate ctrl.
         */
        uint32_t mb_rate_ctrl_en: 1;
        uint32_t reserved_23: 9;
    };
    uint32_t val;
} h264_rc_conf0_reg_t;

/** Type of rc_conf1 register
 *  Video A rate control configuration register1.
 */
typedef union {
    struct {
        /** chroma_dc_qp_delta : R/W; bitpos: [2:0]; default: 0;
         *  Configures video A chroma DC QP offset based on Chroma QP. Chroma DC QP = Chroma
         *  QP(after map) + reg_chroma_dc_qp_delta.
         */
        uint32_t chroma_dc_qp_delta: 3;
        /** chroma_qp_delta : R/W; bitpos: [6:3]; default: 0;
         *  Configures video A chroma QP offset based on luma QP. Chroma QP(before map) = Luma
         *  QP + reg_chroma_qp_delta.
         */
        uint32_t chroma_qp_delta: 4;
        /** qp_min : R/W; bitpos: [12:7]; default: 0;
         *  Configures video A allowed luma QP min value.
         */
        uint32_t qp_min: 6;
        /** qp_max : R/W; bitpos: [18:13]; default: 0;
         *  Configures video A allowed luma QP max value.
         */
        uint32_t qp_max: 6;
        /** mad_frame_pred : R/W; bitpos: [30:19]; default: 0;
         *  Configures vdieo A frame level predicted MB MAD value.
         */
        uint32_t mad_frame_pred: 12;
        uint32_t reserved_31: 1;
    };
    uint32_t val;
} h264_rc_conf1_reg_t;

/** Type of db_bypass register
 *  Video A Deblocking bypass register
 */
typedef union {
    struct {
        /** bypass_db_filter : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to bypass video A deblcoking filter. \\0: Open the
         *  deblock filter\\1: Close the deblock filter
         */
        uint32_t bypass_db_filter: 1;
        uint32_t reserved_1: 31;
    };
    uint32_t val;
} h264_db_bypass_reg_t;

/** Type of roi_region register
 *  Video A H264 ROI region range configure register.
 */
typedef union {
    struct {
        /** roi_region_x : R/W; bitpos: [6:0]; default: 0;
         *  Configures the horizontal start macroblocks of region 0 in Video A.
         */
        uint32_t roi_region_x: 7;
        /** roi_region_y : R/W; bitpos: [13:7]; default: 0;
         *  Configures the  vertical start macroblocks of region 0 in Video A.
         */
        uint32_t roi_region_y: 7;
        /** roi_region_x_len : R/W; bitpos: [20:14]; default: 0;
         *  Configures the number of  macroblocks in horizontal direction of  the region 0 in
         *  Video A.
         */
        uint32_t roi_region_x_len: 7;
        /** roi_region_y_len : R/W; bitpos: [27:21]; default: 0;
         *  Configures the number of  macroblocks in vertical direction of  the region 0 in
         *  Video A.
         */
        uint32_t roi_region_y_len: 7;
        /** roi_region_en : R/W; bitpos: [28]; default: 0;
         *  Configures whether or not to open Video A ROI of region 0 .\\0:Close ROI\\1:Open
         *  ROI.
         */
        uint32_t roi_region_en: 1;
        uint32_t reserved_29: 3;
    };
    uint32_t val;
} h264_roi_region_reg_t;

/** Type of roi_region0_3_qp register
 *  Video A H264 ROI region0, region1,region2,region3 QP register.
 */
typedef union {
    struct {
        /** roi_region0_qp : R/W; bitpos: [6:0]; default: 0;
         *  Configure H264 ROI region0 qp in video A,fixed qp or delta qp.
         */
        uint32_t roi_region0_qp: 7;
        /** roi_region1_qp : R/W; bitpos: [13:7]; default: 0;
         *  Configure H264 ROI region1 qp in video A,fixed qp or delta qp.
         */
        uint32_t roi_region1_qp: 7;
        /** roi_region2_qp : R/W; bitpos: [20:14]; default: 0;
         *  Configure H264 ROI region2 qp in video A,fixed qp or delta qp.
         */
        uint32_t roi_region2_qp: 7;
        /** roi_region3_qp : R/W; bitpos: [27:21]; default: 0;
         *  Configure H264 ROI region3 qp in video A,fixed qp or delta qp.
         */
        uint32_t roi_region3_qp: 7;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} h264_roi_region0_3_qp_reg_t;

