espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_struct.h
/** Type of roi_region4_7_qp register
 *  Video A H264 ROI region4, region5,region6,region7 QP register.
 */
typedef union {
    struct {
        /** roi_region4_qp : R/W; bitpos: [6:0]; default: 0;
         *  Configure H264 ROI region4 qp in video A,fixed qp or delta qp.
         */
        uint32_t roi_region4_qp: 7;
        /** roi_region5_qp : R/W; bitpos: [13:7]; default: 0;
         *  Configure H264 ROI region5 qp in video A,fixed qp or delta qp.
         */
        uint32_t roi_region5_qp: 7;
        /** roi_region6_qp : R/W; bitpos: [20:14]; default: 0;
         *  Configure H264 ROI region6 qp in video A,fixed qp or delta qp.
         */
        uint32_t roi_region6_qp: 7;
        /** roi_region7_qp : R/W; bitpos: [27:21]; default: 0;
         *  Configure H264 ROI region7 qp in video A,fixed qp or delta qp.
         */
        uint32_t roi_region7_qp: 7;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} h264_roi_region4_7_qp_reg_t;

/** Type of no_roi_region_qp_offset register
 *  Video A H264 no roi region QP register.
 */
typedef union {
    struct {
        /** no_roi_region_qp : R/W; bitpos: [6:0]; default: 0;
         *  Configure H264 no region qp in video A, delta qp.
         */
        uint32_t no_roi_region_qp: 7;
        uint32_t reserved_7: 25;
    };
    uint32_t val;
} h264_no_roi_region_qp_offset_reg_t;

/** Type of roi_config register
 *  Video A H264 ROI configure register.
 */
typedef union {
    struct {
        /** roi_en : R/W; bitpos: [0]; default: 0;
         *  Configure whether or not to enable ROI in video A.\\0:not enable ROI\\1:enable ROI.
         */
        uint32_t roi_en: 1;
        /** roi_mode : R/W; bitpos: [1]; default: 0;
         *  Configure the mode of ROI in video A.\\0:fixed qp\\1:delta qp.
         */
        uint32_t roi_mode: 1;
        uint32_t reserved_2: 30;
    };
    uint32_t val;
} h264_roi_config_reg_t;

/** Type of slice_header_remain register
 *  Frame Slice Header remain bit register.
 */
typedef union {
    struct {
        /** slice_remain_bitlength : R/W; bitpos: [2:0]; default: 0;
         *  Configures Slice Header remain bit number
         */
        uint32_t slice_remain_bitlength: 3;
        /** slice_remain_bit : R/W; bitpos: [10:3]; default: 0;
         *  Configures Slice Header remain bit
         */
        uint32_t slice_remain_bit: 8;
        uint32_t reserved_11: 21;
    };
    uint32_t val;
} h264_slice_header_remain_reg_t;

/** Type of slice_header_byte_length register
 *  Frame Slice Header byte length register.
 */
typedef union {
    struct {
        /** slice_byte_length : R/W; bitpos: [3:0]; default: 0;
         *  Configures Slice Header byte number
         */
        uint32_t slice_byte_length: 4;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} h264_slice_header_byte_length_reg_t;

/** Type of bs_threshold register
 *  Bitstream buffer overflow threshold register
 */
typedef union {
    struct {
        /** bs_buffer_threshold : R/W; bitpos: [6:0]; default: 48;
         *  Configures bitstream buffer overflow threshold. This value should be bigger than
         *  the encode bytes of one 4x4 submb.
         */
        uint32_t bs_buffer_threshold: 7;
        uint32_t reserved_7: 25;
    };
    uint32_t val;
} h264_bs_threshold_reg_t;

/** Type of slice_header_byte register
 *  Frame Slice Header byte 32 bit register.
 */
typedef union {
    struct {
        /** byte : R/W; bitpos: [31:0]; default: 0;
         *  Configures Slice Header 32 bit
         */
        uint32_t byte: 32;
    };
    uint32_t val;
} h264_slice_header_reg_t;

/** Type of conf register
 *  General configuration register.
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to open register clock gate.\\0: Open the clock gate only
         *  when application writes registers\\1: Force open the clock gate for register
         */
        uint32_t clk_en: 1;
        /** rec_ram_clk_en2 : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to open the clock gate for rec ram2.\\0: Open the clock
         *  gate only when application writes or reads rec ram2\\1: Force open the clock gate
         *  for rec ram2
         */
        uint32_t rec_ram_clk_en2: 1;
        /** rec_ram_clk_en1 : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to open the clock gate for rec ram1.\\0: Open the clock
         *  gate only when application writes or reads rec ram1\\1: Force open the clock gate
         *  for rec ram1
         */
        uint32_t rec_ram_clk_en1: 1;
        /** quant_ram_clk_en2 : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to open the clock gate for quant ram2.\\0: Open the clock
         *  gate only when application writes or reads quant ram2\\1: Force open the clock gate
         *  for quant ram2
         */
        uint32_t quant_ram_clk_en2: 1;
        /** quant_ram_clk_en1 : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to open the clock gate for quant ram1.\\0: Open the clock
         *  gate only when application writes or reads quant ram1\\1: Force open the clock gate
         *  for quant ram1
         */
        uint32_t quant_ram_clk_en1: 1;
        /** pre_ram_clk_en : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to open the clock gate for pre ram.\\0: Open the clock
         *  gate only when application writes or reads pre ram\\1: Force open the clock gate
         *  for pre ram
         */
        uint32_t pre_ram_clk_en: 1;
        /** mvd_ram_clk_en : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to open the clock gate for mvd ram.\\0: Open the clock
         *  gate only when application writes or reads mvd ram\\1: Force open the clock gate
         *  for mvd ram
         */
        uint32_t mvd_ram_clk_en: 1;
        /** mc_ram_clk_en : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to open the clock gate for mc ram.\\0: Open the clock
         *  gate only when application writes or reads mc ram\\1: Force open the clock gate for
         *  mc ram
         */
        uint32_t mc_ram_clk_en: 1;
        /** ref_ram_clk_en : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to open the clock gate for ref ram.\\0: Open the clock
         *  gate only when application writes or reads ref ram\\1: Force open the clock gate
         *  for ref ram
         */
        uint32_t ref_ram_clk_en: 1;
        /** i4x4_ref_ram_clk_en : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to open the clock gate for i4x4_mode ram.\\0: Open the
         *  clock gate only when application writes or reads i4x4_mode ram\\1: Force open the
         *  clock gate for i4x4_mode ram
         */
        uint32_t i4x4_ref_ram_clk_en: 1;
        /** ime_ram_clk_en : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to open the clock gate for ime ram.\\0: Open the clock
         *  gate only when application writes or reads ime ram\\1: Force open the clock gate
         *  for ime ram
         */
        uint32_t ime_ram_clk_en: 1;
        /** fme_ram_clk_en : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to open the clock gate for fme ram.\\0: Open the clock
         *  gate only when application writes or readsfme ram\\1: Force open the clock gate for
         *  fme ram
         */
        uint32_t fme_ram_clk_en: 1;
        /** fetch_ram_clk_en : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to open the clock gate for fetch ram.\\0: Open the clock
         *  gate only when application writes or reads fetch ram\\1: Force open the clock gate
         *  for fetch ram
         */
        uint32_t fetch_ram_clk_en: 1;
        /** db_ram_clk_en : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to open the clock gate for db ram.\\0: Open the clock
         *  gate only when application writes or reads db ram\\1: Force open the clock gate for
         *  db ram
         */
        uint32_t db_ram_clk_en: 1;
        /** cur_mb_ram_clk_en : R/W; bitpos: [14]; default: 0;
         *  Configures whether or not to open the clock gate for cur_mb ram.\\0: Open the clock
         *  gate only when application writes or reads cur_mb ram\\1: Force open the clock gate
         *  for cur_mb ram
         */
        uint32_t cur_mb_ram_clk_en: 1;
        /** cavlc_ram_clk_en : R/W; bitpos: [15]; default: 0;
         *  Configures whether or not to open the clock gate for cavlc ram.\\0: Open the clock
         *  gate only when application writes or reads cavlc ram\\1: Force open the clock gate
         *  for cavlc ram
         */
        uint32_t cavlc_ram_clk_en: 1;
        /** ime_clk_en : R/W; bitpos: [16]; default: 0;
         *  Configures whether or not to open the clock gate for ime.\\0: Open the clock gate
         *  only when ime work\\1: Force open the clock gate for ime
         */
        uint32_t ime_clk_en: 1;
        /** fme_clk_en : R/W; bitpos: [17]; default: 0;
         *  Configures whether or not to open the clock gate for fme.\\0: Open the clock gate
         *  only when fme work\\1: Force open the clock gate for fme
         */
        uint32_t fme_clk_en: 1;
        /** mc_clk_en : R/W; bitpos: [18]; default: 0;
         *  Configures whether or not to open the clock gate for mc.\\0: Open the clock gate
         *  only when mc work\\1: Force open the clock gate for mc
         */
        uint32_t mc_clk_en: 1;
        /** interpolator_clk_en : R/W; bitpos: [19]; default: 0;
         *  Configures whether or not to open the clock gate for interpolator.\\0: Open the
         *  clock gate only when interpolator work\\1: Force open the clock gate for
         *  interpolator
         */
        uint32_t interpolator_clk_en: 1;
        /** db_clk_en : R/W; bitpos: [20]; default: 0;
         *  Configures whether or not to open the clock gate for deblocking filter.\\0: Open
         *  the clock gate only when deblocking filter work\\1: Force open the clock gate for
         *  deblocking filter
         */
        uint32_t db_clk_en: 1;
        /** clavlc_clk_en : R/W; bitpos: [21]; default: 0;
         *  Configures whether or not to open the clock gate for cavlc.\\0: Open the clock gate
         *  only when cavlc work\\1: Force open the clock gate for cavlc
         */
        uint32_t clavlc_clk_en: 1;
        /** intra_clk_en : R/W; bitpos: [22]; default: 0;
         *  Configures whether or not to open the clock gate for intra.\\0: Open the clock gate
         *  only when intra work\\1: Force open the clock gate for intra
         */
        uint32_t intra_clk_en: 1;
        /** deci_clk_en : R/W; bitpos: [23]; default: 0;
         *  Configures whether or not to open the clock gate for decimate.\\0: Open the clock
         *  gate only when decimate work\\1: Force open the clock gate for decimate
         */
        uint32_t deci_clk_en: 1;
        /** bs_clk_en : R/W; bitpos: [24]; default: 0;
         *  Configures whether or not to open the clock gate for bs buffer.\\0: Open the clock
         *  gate only when bs buffer work\\1: Force open the clock gate for bs buffer
         */
        uint32_t bs_clk_en: 1;
        /** mv_merge_clk_en : R/W; bitpos: [25]; default: 0;
         *  Configures whether or not to open the clock gate for mv merge.\\0: Open the clock
         *  gate only when mv merge work\\1: Force open the clock gate for mv merge
         */
        uint32_t mv_merge_clk_en: 1;

        /** cur_mb_rdcmb_clk_en : R/W; bitpos: [26]; default: 0;
         *  Configures whether or not to open the clock gate for cur_mb read macroblock.
         *  0: Open the clock gate only when cur_mb read macroblock work
         *  1: Force open the clock gate for  cur_mb read macroblock
         */
        uint32_t cur_mb_rdcmb_clk_en: 1;
        /** cur_mb_refresh_reggroup_clk_en : R/W; bitpos: [27]; default: 0;
         *  Configures whether or not to open the clock gate for cur_mb refresh register group.
         *  0: Open the clock gate only when cur_mb refresh register group work
         *  1: Force open the clock gate for  cur_mb  refresh register group
         */
        uint32_t cur_mb_refresh_reggroup_clk_en: 1;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} h264_conf_reg_t;

/** Type of mv_merge_config register
 *  Mv merge configuration register.
 */
typedef union {
    struct {
        /** mv_merge_type : R/W; bitpos: [1:0]; default: 0;
         *  Configure mv merge type.\\0: merge p16x16 mv\\1: merge min mv\\2: merge max mv\\3:
         *  not valid.
         */
        uint32_t mv_merge_type: 2;
        /** int_mv_out_en : R/W; bitpos: [2]; default: 0;
         *  Configure mv merge output integer part not zero mv or all part not zero mv.\\0:
         *  output all part not zero mv\\1: output integer part not zero mv.
         */
        uint32_t int_mv_out_en: 1;
        /** a_mv_merge_en : R/W; bitpos: [3]; default: 0;
         *  Configure whether or not to enable video A mv merge.\\0: disable\\1: enable.
         */
        uint32_t a_mv_merge_en: 1;
        /** b_mv_merge_en : R/W; bitpos: [4]; default: 0;
         *  Configure whether or not to enable video B mv merge.\\0: disable\\1: enable.
         */
        uint32_t b_mv_merge_en: 1;
        /** mb_valid_num : RO; bitpos: [17:5]; default: 0;
         *  Represents the valid mb number of mv merge output.
         */
        uint32_t mb_valid_num: 13;
        uint32_t reserved_18: 14;
    };
    uint32_t val;
} h264_mv_merge_config_reg_t;

/** Type of debug_dma_sel register
 *  Debug H264 DMA select register
 */
typedef union {
    struct {
        /** dbg_dma_sel : R/W; bitpos: [7:0]; default: 0;
         *  Every bit represents a dma in h264
         */
        uint32_t dbg_dma_sel: 8;
        uint32_t reserved_8: 24;
    };
    uint32_t val;
} h264_debug_dma_sel_reg_t;

/** Type of a_ori_conf register
 *  Video A original picture configuration register.
 */
typedef union {
    struct {
        /** ori_color_space : R/W; bitpos: [2:0]; default: 4;
         *  Configures video A original picture color space.
         *  0: RGB888
         *  1: RGB565
         *  2: YUV444
         *  3: YUV422
         *  4: YUV420
         *  5: GRAY
         *  Others: Invalid
         */
        uint32_t ori_color_space: 3;
        uint32_t reserved_3: 29;
    };
    uint32_t val;
} h264_ori_conf_reg_t;

/** Type of ori_debug_conf register
 *  Original picture debug configuration register.
 */
typedef union {
    struct {
        /** dbg_replace_ori_data_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether to replace original picture pixels.
         *  0: not replace
         *  1: replace
         */
        uint32_t dbg_replace_ori_data_en: 1;
        /** dbg_replace_ori_data : R/W; bitpos: [24:1]; default: 0;
         *  Configures original picture pixels to be replaced. When the original picture color
         *  space is RGB, byte0~2 is BGR. When the original picture color space is YUV, byte0~2
         *  is VUY. When the original picture color space is GRAY, byte0 is GRAY.
         */
        uint32_t dbg_replace_ori_data: 24;
        uint32_t reserved_25: 7;
    };
    uint32_t val;
} h264_ori_debug_conf_reg_t;

/** Type of mv_merge_debug_conf register
 *  Original picture debug configuration register.
 */
typedef union {
    struct {
        /** dbg_replace_mv_merge_data_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether to replace mv merge data.
         *  0: not replace
         *  1: replace
         */
        uint32_t dbg_replace_mv_merge_data_en: 1;
        /** dbg_replace_mv_merge_data : R/W; bitpos: [8:1]; default: 0;
         *  Configures mv merge data to be replaced.
         */
        uint32_t dbg_replace_mv_merge_data: 8;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_mv_merge_debug_conf_reg_t;

/** Type of bs_debug_cong register
 *  Encode bitstream debug configuration register
 */
typedef union {
    struct {
        /** dbg_replace_wr_bs_data_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to replace bs data.
         *  0: not replace
         *  1: replace
         */
        uint32_t dbg_replace_wr_bs_data_en: 1;
        /** dbg_replace_wr_bs_data : R/W; bitpos: [8:1]; default: 0;
         *  Configures bs data to be replaced
         */
        uint32_t dbg_replace_wr_bs_data: 8;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} h264_bs_debug_cong_reg_t;

