espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_struct.h
/** Type of db_wr_temp_debug_cong register
 *  Deblocking filter write temp debug configuration register
 */
typedef union {
    struct {
        /** dbg_replace_wr_db_temp_data_en : R/W; bitpos: [0]; default: 0;
         *  Configure deblocking filter whether or not to replace write temp data.
         *  0: not replace
         *  1: replace
         */
        uint32_t dbg_replace_wr_db_temp_data_en: 1;
        /** dbg_replace_wr_db_temp_data : R/W; bitpos: [24:1]; default: 0;
         *  Configure deblocking filter write temp data to be replaced.byte0~2 is VUY
         */
        uint32_t dbg_replace_wr_db_temp_data: 24;
        uint32_t reserved_25: 7;
    };
    uint32_t val;
} h264_db_wr_temp_debug_cong_reg_t;

/** Type of db_rd_temp_debug_cong register
 *  Deblocking filter read temp debug configuration register
 */
typedef union {
    struct {
        /** dbg_replace_rd_db_temp_data_en : R/W; bitpos: [0]; default: 0;
         *  Configure deblocking filter whether or not to replace read temp data.
         *  0: not replace
         *  1: replace
         */
        uint32_t dbg_replace_rd_db_temp_data_en: 1;
        /** dbg_replace_rd_db_temp_data : R/W; bitpos: [24:1]; default: 0;
         *  Configure deblocking filter read temp data to be replaced.byte0~2 is VUY
         */
        uint32_t dbg_replace_rd_db_temp_data: 24;
        uint32_t reserved_25: 7;
    };
    uint32_t val;
} h264_db_rd_temp_debug_cong_reg_t;

/** Type of db_wr_debug_cong register
 *  Deblocking filter final data debug configuration register
 */
typedef union {
    struct {
        /** dbg_replace_wr_db_data_en : R/W; bitpos: [0]; default: 0;
         *  Configure deblocking filter whether or not to replace write data.
         *  0: not replace
         *  1: replace
         */
        uint32_t dbg_replace_wr_db_data_en: 1;
        /** dbg_replace_wr_db_data : R/W; bitpos: [24:1]; default: 0;
         *  Configure deblocking filter write data to be replaced.byte0~2 is VUY
         */
        uint32_t dbg_replace_wr_db_data: 24;
        uint32_t reserved_25: 7;
    };
    uint32_t val;
} h264_db_wr_debug_cong_reg_t;

/** Type of ref_debug_cong register
 *  Deblocking filter final data debug configuration register
 */
typedef union {
    struct {
        /** dbg_replace_ref_data_en : R/W; bitpos: [0]; default: 0;
         *  Configure whether to replace reference picture pixels.
         *  0: not replace
         *  1: replace
         */
        uint32_t dbg_replace_ref_data_en: 1;
        /** dbg_replace_ref_data : R/W; bitpos: [24:1]; default: 0;
         *  Configure reference picture pixels to be replaced.byte0~2 is VUY
         */
        uint32_t dbg_replace_ref_data: 24;
        uint32_t reserved_25: 7;
    };
    uint32_t val;
} h264_ref_debug_cong_reg_t;

/** Group: Status Register */
/** Type of rc_status0 register
 *  Rate control status register0.
 */
typedef union {
    struct {
        /** frame_mad_sum : RO; bitpos: [20:0]; default: 0;
         *  Represents all MB actual MAD sum value of one frame.
         */
        uint32_t frame_mad_sum: 21;
        uint32_t reserved_21: 11;
    };
    uint32_t val;
} h264_rc_status0_reg_t;

/** Type of rc_status1 register
 *  Rate control status register1.
 */
typedef union {
    struct {
        /** frame_enc_bits : RO; bitpos: [26:0]; default: 0;
         *  Represents all MB actual encoding bits sum value of one frame.
         */
        uint32_t frame_enc_bits: 27;
        uint32_t reserved_27: 5;
    };
    uint32_t val;
} h264_rc_status1_reg_t;

/** Type of rc_status2 register
 *  Rate control status register2.
 */
typedef union {
    struct {
        /** frame_qp_sum : RO; bitpos: [18:0]; default: 0;
         *  Represents all MB actual luma QP sum value of one frame.
         */
        uint32_t frame_qp_sum: 19;
        uint32_t reserved_19: 13;
    };
    uint32_t val;
} h264_rc_status2_reg_t;

/** Type of sys_status register
 *  System status register.
 */
typedef union {
    struct {
        /** frame_num : RO; bitpos: [8:0]; default: 0;
         *  Represents current frame number.
         */
        uint32_t frame_num: 9;
        /** dual_stream_sel : RO; bitpos: [9]; default: 0;
         *  Represents which register group is used for cur frame.\\0: Register group A is
         *  used\\1: Register group B is used.
         */
        uint32_t dual_stream_sel: 1;
        /** intra_flag : RO; bitpos: [10]; default: 0;
         *  Represents the type of current encoding frame.\\0: P frame\\1: I frame.
         */
        uint32_t intra_flag: 1;
        uint32_t reserved_11: 21;
    };
    uint32_t val;
} h264_sys_status_reg_t;

/** Type of frame_code_length register
 *  Frame code byte length register.
 */
typedef union {
    struct {
        /** frame_code_length : RO; bitpos: [23:0]; default: 0;
         *  Represents current frame code byte length.
         */
        uint32_t frame_code_length: 24;
        uint32_t reserved_24: 8;
    };
    uint32_t val;
} h264_frame_code_length_reg_t;

/** Type of debug_info0 register
 *  Debug information register0.
 */
typedef union {
    struct {
        /** top_ctrl_inter_debug_state : RO; bitpos: [3:0]; default: 0;
         *  Represents top_ctrl_inter module FSM info.
         */
        uint32_t top_ctrl_inter_debug_state: 4;
        /** top_ctrl_intra_debug_state : RO; bitpos: [6:4]; default: 0;
         *  Represents top_ctrl_intra module FSM info.
         */
        uint32_t top_ctrl_intra_debug_state: 3;
        /** p_i_cmp_debug_state : RO; bitpos: [9:7]; default: 0;
         *  Represents p_i_cmp module FSM info.
         */
        uint32_t p_i_cmp_debug_state: 3;
        /** mvd_debug_state : RO; bitpos: [12:10]; default: 0;
         *  Represents mvd module FSM info.
         */
        uint32_t mvd_debug_state: 3;
        /** mc_chroma_ip_debug_state : RO; bitpos: [13]; default: 0;
         *  Represents mc_chroma_ip module FSM info.
         */
        uint32_t mc_chroma_ip_debug_state: 1;
        /** intra_16x16_chroma_ctrl_debug_state : RO; bitpos: [17:14]; default: 0;
         *  Represents intra_16x16_chroma_ctrl module FSM info.
         */
        uint32_t intra_16x16_chroma_ctrl_debug_state: 4;
        /** intra_4x4_ctrl_debug_state : RO; bitpos: [21:18]; default: 0;
         *  Represents intra_4x4_ctrl module FSM info.
         */
        uint32_t intra_4x4_ctrl_debug_state: 4;
        /** intra_top_ctrl_debug_state : RO; bitpos: [24:22]; default: 0;
         *  Represents intra_top_ctrl module FSM info.
         */
        uint32_t intra_top_ctrl_debug_state: 3;
        /** ime_ctrl_debug_state : RO; bitpos: [27:25]; default: 0;
         *  Represents ime_ctrl module FSM info.
         */
        uint32_t ime_ctrl_debug_state: 3;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} h264_debug_info0_reg_t;

