espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_struct.h
/** Type of debug_info1 register
 *  Debug information register1.
 */
typedef union {
    struct {
        /** fme_ctrl_debug_state : RO; bitpos: [2:0]; default: 0;
         *  Represents fme_ctrl module FSM info.
         */
        uint32_t fme_ctrl_debug_state: 3;
        /** deci_calc_debug_state : RO; bitpos: [4:3]; default: 0;
         *  Represents deci_calc module's FSM info. DEV use only.
         */
        uint32_t deci_calc_debug_state: 2;
        /** db_debug_state : RO; bitpos: [7:5]; default: 0;
         *  Represents db module FSM info.
         */
        uint32_t db_debug_state: 3;
        /** cavlc_enc_debug_state : RO; bitpos: [11:8]; default: 0;
         *  Represents cavlc module enc FSM info.
         */
        uint32_t cavlc_enc_debug_state: 4;
        /** cavlc_scan_debug_state : RO; bitpos: [15:12]; default: 0;
         *  Represents cavlc module scan FSM info.
         */
        uint32_t cavlc_scan_debug_state: 4;
        /** cavlc_ctrl_debug_state : RO; bitpos: [17:16]; default: 0;
         *  Represents cavlc module ctrl FSM info.
         */
        uint32_t cavlc_ctrl_debug_state: 2;

        uint32_t reserved_19: 14;
    };
    uint32_t val;
} h264_debug_info1_reg_t;

/** Type of debug_info2 register
 *  Debug information register2.
 */
typedef union {
    struct {
        /** p_rc_done_debug_flag : RO; bitpos: [0]; default: 0;
         *  Represents p rate ctrl done status.\\0: not done\\1: done.
         */
        uint32_t p_rc_done_debug_flag: 1;
        /** p_p_i_cmp_done_debug_flag : RO; bitpos: [1]; default: 0;
         *  Represents p p_i_cmp done status.\\0: not done\\1: done.
         */
        uint32_t p_p_i_cmp_done_debug_flag: 1;
        /** p_mv_merge_done_debug_flag : RO; bitpos: [2]; default: 0;
         *  Represents p mv merge done status.\\0: not done\\1: done.
         */
        uint32_t p_mv_merge_done_debug_flag: 1;
        /** p_move_ori_done_debug_flag : RO; bitpos: [3]; default: 0;
         *  Represents p move origin done status.\\0: not done\\1: done.
         */
        uint32_t p_move_ori_done_debug_flag: 1;
        /** p_mc_done_debug_flag : RO; bitpos: [4]; default: 0;
         *  Represents p mc done status.\\0: not done\\1: done.
         */
        uint32_t p_mc_done_debug_flag: 1;
        /** p_ime_done_debug_flag : RO; bitpos: [5]; default: 0;
         *  Represents p ime done status.\\0: not done\\1: done.
         */
        uint32_t p_ime_done_debug_flag: 1;
        /** p_get_ori_done_debug_flag : RO; bitpos: [6]; default: 0;
         *  Represents p get origin done status.\\0: not done\\1: done.
         */
        uint32_t p_get_ori_done_debug_flag: 1;
        /** p_fme_done_debug_flag : RO; bitpos: [7]; default: 0;
         *  Represents p fme done status.\\0: not done\\1: done.
         */
        uint32_t p_fme_done_debug_flag: 1;
        /** p_fetch_done_debug_flag : RO; bitpos: [8]; default: 0;
         *  Represents p fetch done status.\\0: not done\\1: done.
         */
        uint32_t p_fetch_done_debug_flag: 1;
        /** p_db_done_debug_flag : RO; bitpos: [9]; default: 0;
         *  Represents p deblocking done status.\\0: not done\\1: done.
         */
        uint32_t p_db_done_debug_flag: 1;
        /** p_bs_buf_done_debug_flag : RO; bitpos: [10]; default: 0;
         *  Represents p bitstream buffer done status.\\0: not done\\1: done.
         */
        uint32_t p_bs_buf_done_debug_flag: 1;
        /** ref_move_2mb_line_done_debug_flag : RO; bitpos: [11]; default: 0;
         *  Represents dma move 2 ref mb line done status.\\0: not done\\1: done.
         */
        uint32_t ref_move_2mb_line_done_debug_flag: 1;
        /** i_p_i_cmp_done_debug_flag : RO; bitpos: [12]; default: 0;
         *  Represents I p_i_cmp done status.\\0: not done\\1: done.
         */
        uint32_t i_p_i_cmp_done_debug_flag: 1;
        /** i_move_ori_done_debug_flag : RO; bitpos: [13]; default: 0;
         *  Represents I move origin done status.\\0: not done\\1: done.
         */
        uint32_t i_move_ori_done_debug_flag: 1;
        /** i_get_ori_done_debug_flag : RO; bitpos: [14]; default: 0;
         *  Represents I get origin done status.\\0: not done\\1: done.
         */
        uint32_t i_get_ori_done_debug_flag: 1;
        /** i_ec_done_debug_flag : RO; bitpos: [15]; default: 0;
         *  Represents I encoder done status.\\0: not done\\1: done.
         */
        uint32_t i_ec_done_debug_flag: 1;
        /** i_db_done_debug_flag : RO; bitpos: [16]; default: 0;
         *  Represents I deblocking done status.\\0: not done\\1: done.
         */
        uint32_t i_db_done_debug_flag: 1;
        /** i_bs_buf_done_debug_flag : RO; bitpos: [17]; default: 0;
         *  Represents I bitstream buffer done status.\\0: not done\\1: done.
         */
        uint32_t i_bs_buf_done_debug_flag: 1;
        uint32_t reserved_18: 14;
    };
    uint32_t val;
} h264_debug_info2_reg_t;


/** Group: Interrupt Register */
/** Type of int_raw register
 *  Interrupt raw status register
 */
typedef union {
    struct {
        /** db_tmp_ready_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  Raw status bit: The raw interrupt status of  H264_DB_TMP_READY_INT. Triggered when
         *  H264 written enough db tmp pixel.
         */
        uint32_t db_tmp_ready_int_raw: 1;
        /** rec_ready_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  Raw status bit: The raw interrupt status of  H264_REC_READY_INT. Triggered when
         *  H264 encoding enough reconstruct pixel.
         */
        uint32_t rec_ready_int_raw: 1;
        /** frame_done_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  Raw status bit: The raw interrupt status of  H264_FRAME_DONE_INT. Triggered when
         *  H264 encoding one frame done.
         */
        uint32_t frame_done_int_raw: 1;
        /** dma_move_2mb_line_done_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  Raw status bit: The raw interrupt status of H264_DMA_MOVE_2MB_LINE_DONE_INT.
         *  Triggered when H264 move two MB lines of reference frame from external mem to
         *  internal mem done.
         */
        uint32_t dma_move_2mb_line_done_int_raw: 1;
        /** bs_buffer_overflow_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  Raw status bit: The raw interrupt status of H264_BS_BUFFER_OVERFLOW_INT. Triggered
         *  when H264 bit stream buffer overflow.
         */
        uint32_t bs_buffer_overflow_int_raw: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_int_raw_reg_t;

/** Type of int_st register
 *  Interrupt masked status register
 */
typedef union {
    struct {
        /** db_tmp_ready_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status of H264_DB_TMP_READY_INT. Valid only when the
         *  H264_DB_TMP_READY_INT_ENA is set to 1.
         */
        uint32_t db_tmp_ready_int_st: 1;
        /** rec_ready_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status of H264_REC_READY_INT. Valid only when the
         *  H264_REC_READY_INT_ENA is set to 1.
         */
        uint32_t rec_ready_int_st: 1;
        /** frame_done_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status of H264_FRAME_DONE_INT. Valid only when the
         *  H264_FRAME_DONE_INT_ENA is set to 1.
         */
        uint32_t frame_done_int_st: 1;
        /** dma_move_2mb_line_done_int_st : RO; bitpos: [3]; default: 0;
         *  Masked status bit: The masked interrupt status of H264_DMA_MOVE_2MB_LINE_DONE_INT.
         *  Valid only when the H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA is set to 1.
         */
        uint32_t dma_move_2mb_line_done_int_st: 1;
        /** bs_buffer_overflow_int_st : RO; bitpos: [4]; default: 0;
         *  Masked status bit: The masked interrupt status of H264_BS_BUFFER_OVERFLOW_INT.
         *  Valid only when the H264_BS_BUFFER_OVERFLOW_INT_ENA is set to 1.
         */
        uint32_t bs_buffer_overflow_int_st: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_int_st_reg_t;

/** Type of int_ena register
 *  Interrupt enable register
 */
typedef union {
    struct {
        /** db_tmp_ready_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable H264_DB_TMP_READY_INT.
         */
        uint32_t db_tmp_ready_int_ena: 1;
        /** rec_ready_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable H264_REC_READY_INT.
         */
        uint32_t rec_ready_int_ena: 1;
        /** frame_done_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable H264_FRAME_DONE_INT.
         */
        uint32_t frame_done_int_ena: 1;
        /** dma_move_2mb_line_done_int_ena : R/W; bitpos: [3]; default: 0;
         *  Enable bit: Write 1 to enable H264_DMA_MOVE_2MB_LINE_DONE_INT.
         */
        uint32_t dma_move_2mb_line_done_int_ena: 1;
        /** bs_buffer_overflow_int_ena : R/W; bitpos: [4]; default: 0;
         *  Enable bit: Write 1 to enable H264_BS_BUFFER_OVERFLOW_INT.
         */
        uint32_t bs_buffer_overflow_int_ena: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_int_ena_reg_t;

/** Type of int_clr register
 *  Interrupt clear register
 */
typedef union {
    struct {
        /** db_tmp_ready_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clear H264_DB_TMP_READY_INT.
         */
        uint32_t db_tmp_ready_int_clr: 1;
        /** rec_ready_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clear H264_REC_READY_INT.
         */
        uint32_t rec_ready_int_clr: 1;
        /** frame_done_int_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear H264_FRAME_DONE_INT.
         */
        uint32_t frame_done_int_clr: 1;
        /** dma_move_2mb_line_done_int_clr : WT; bitpos: [3]; default: 0;
         *  Clear bit: Write 1 to clear H264_DMA_MOVE_2MB_LINE_DONE_INT.
         */
        uint32_t dma_move_2mb_line_done_int_clr: 1;
        /** bs_buffer_overflow_int_clr : WT; bitpos: [4]; default: 0;
         *  Clear bit: Write 1 to clear H264_BS_BUFFER_OVERFLOW_INT.
         */
        uint32_t bs_buffer_overflow_int_clr: 1;
        uint32_t reserved_5: 27;
    };
    uint32_t val;
} h264_int_clr_reg_t;


