espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/h264_struct.h
/** Group: Version Register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** ledc_date : R/W; bitpos: [27:0]; default: 37823232;
         *  Configures the version.
         */
        uint32_t ledc_date: 28;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} h264_date_reg_t;


typedef struct {
    volatile h264_sys_mb_res_reg_t sys_mb_res;
    volatile h264_sys_conf_reg_t sys_conf;
    volatile h264_deci_score_reg_t deci_score;
    volatile h264_deci_score_offset_reg_t deci_score_offset;
    volatile h264_rc_conf0_reg_t rc_conf0;
    volatile h264_rc_conf1_reg_t rc_conf1;
    volatile h264_db_bypass_reg_t db_bypass;
    volatile h264_roi_region_reg_t roi_region[8];
    volatile h264_roi_region0_3_qp_reg_t roi_region0_3_qp;
    volatile h264_roi_region4_7_qp_reg_t roi_region4_7_qp;
    volatile h264_no_roi_region_qp_offset_reg_t no_roi_region_qp_offset;
    volatile h264_roi_config_reg_t roi_config;
} h264_ctrl_regs_t;

typedef struct {
    volatile h264_sys_ctrl_reg_t sys_ctrl;
    volatile h264_gop_conf_reg_t gop_conf;
    volatile h264_ctrl_regs_t ctrl[2];
    volatile h264_rc_status0_reg_t rc_status0;
    volatile h264_rc_status1_reg_t rc_status1;
    volatile h264_rc_status2_reg_t rc_status2;
    volatile h264_slice_header_remain_reg_t slice_header_remain;
    volatile h264_slice_header_byte_length_reg_t slice_header_byte_length;
    volatile h264_bs_threshold_reg_t bs_threshold;
    volatile h264_slice_header_reg_t slice_header[2];
    volatile h264_int_raw_reg_t int_raw;
    volatile h264_int_st_reg_t int_st;
    volatile h264_int_ena_reg_t int_ena;
    volatile h264_int_clr_reg_t int_clr;
    volatile h264_conf_reg_t conf;
    volatile h264_mv_merge_config_reg_t mv_merge_config;
    volatile h264_debug_dma_sel_reg_t debug_dma_sel;
    volatile h264_sys_status_reg_t sys_status;
    volatile h264_frame_code_length_reg_t frame_code_length;
    volatile h264_debug_info0_reg_t debug_info0;
    volatile h264_debug_info1_reg_t debug_info1;
    volatile h264_debug_info2_reg_t debug_info2;
    volatile h264_date_reg_t date;
    volatile h264_ori_conf_reg_t ori_conf[2];
    volatile h264_ori_debug_conf_reg_t ori_debug_conf;
    volatile h264_mv_merge_debug_conf_reg_t mv_merge_debug_conf;
    volatile h264_bs_debug_cong_reg_t bs_debug_cong;
    volatile h264_db_wr_temp_debug_cong_reg_t db_wr_temp_debug_cong;
    volatile h264_db_rd_temp_debug_cong_reg_t db_rd_temp_debug_cong;
    volatile h264_db_wr_debug_cong_reg_t db_wr_debug_cong;
    volatile h264_ref_debug_cong_reg_t ref_debug_cong;
} h264_dev_t;

#ifndef __cplusplus
_Static_assert(sizeof(h264_dev_t) == 0x118, "Invalid size of h264_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
